imported/solids4foam/tutorials/fluids/cylinderInChannel/overset/movingCylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    OversetFaces
    {
        type overset;
        value uniform (0 0 0);
        coupledFringe yes;

        setHoleCellValue  yes;
        holeCellValue     (0 0 0);
    }
    TopWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    Inlet
    {
        type transitionalParabolicVelocity;
        maxValue 1.5;
        n (1 0 0);
        y (0 1 0);
        boundBoxMin (-2 -2 -0.223787846);
        boundBoxMax (-2 2.1 0.223787846);
        transitionPeriod 0;
        
        value           uniform (0 0 0);
    }
    Outlet
    {
        type            zeroGradient;
    }
    OuterCylinder
    {
        type            zeroGradient;
    }
    CylinderWall
    {
        type            newMovingWallVelocity;
        value           uniform (0 0 0);
    }
    BottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}

// ************************************************************************* //
