imported/solids4foam/tutorials/fluids/cylinderInChannel/overset/movingCylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p|pFinal"
    {
        solver           BiCGStab;
        preconditioner   DILU;

//         solver           CG;
//         preconditioner   DIC;

        maxIter          1000;
        tolerance        1e-7;
        relTol           0;
    }

    U
    {
        solver           BiCGStab;
        preconditioner   DILU;

        tolerance        1e-06;
        relTol           0;
        maxIter          200;
    }
}

PIMPLE 
{
    nOuterCorrectors 2;
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    U    1;
    UFinal 1;
    // p    0.3;
}

// ************************************************************************* //
